import asyncio
from src.backend.modules.transcriber import Transcriber
# import sys
# import os


async def main():
    transcriber = Transcriber()
    full_transcript = "Alice: Доброго ранку, всім! \
Alice: Я думаю, ми морж емо почати нашу зус річ сьогодні. \
Alice: Перш за все, поб, можеш повісити про оновлення на проекті?\
Bob: Так, звісно! \
Bob: За останній тиждень ми зробили досить багато... бачте, багато чого на проекті. \
Bob: успішно завершили ап тестування, і тепер можемо перейти до грації. \
Carol: Я просто хотіла у нити, чи все ще ми\
Carol: старі інтер фейси для цієї інтеграції? \
Carol: Я пам'ятаю, що були питання з пі, вони вже рішення?\
Bob: Так, ми все вирішили.\
Bob: Але нам ще треба перевірити декілька речей \
Bob: повним запуском.\
Alice: Добре, якщо питання з інтеграцією вирішено,\
Alice: до наступного питання. \
Alice: Я хочу обговорити джет на наступний кварта. \
Alice: оп, ти вже аналізував витрати? \
Bob: Так, я підготував анал із, але є деякі менти, які потрібно доопрацювати особ \
Bob: комунікаційних витрат.\
Unknown: Ми повинні звернути увагу на це в найближчі дні.\
Carol: Можливо, варто трохи з низ нити витрати на маркетинг, щоб залишити більше для слід день та розробок? \
Alice: Це гарна ідея, ми повинні додатково проаналізувати, чи зможемо ми так зробити. \
"

    post_meeting_recording = "\
Доброго ранку, всім! Я думаю, ми можемо почати нашу зустріч сьогодні. Перш за все, Боб, чи міг би ти розповісти про оновлення на проекті?\
Так, звісно! За останній тиждень ми досягли значного прогресу. Найголовніше — ми успішно завершили етап тестування, і тепер можемо перейти до інтеграції.\
Я просто хотіла уточнити, чи будемо ми використовувати старі інтерфейси для цієї інтеграції? Я пам'ятаю, що були питання з API, вони вже вирішені?\
Так, ми все вирішили. Однак нам потрібно ще перевірити декілька моментів у документації перед тим, як остаточно запустити інтеграцію.\
Добре, якщо питання з інтеграцією вирішене, давайте тоді перейдемо до наступного питання. Я хочу обговорити бюджет на наступний квартал. Боб, чи підготував ти аналіз витрат?\
Так, я підготував попередній аналіз. Але є кілька моментів, які потребують доопрацювання, зокрема щодо комунікаційних витрат. Нам варто звернути на це увагу найближчим часом.\
Carol: Можливо, нам варто знизити витрати на маркетинг, щоб мати більше ресурсів для досліджень та розробок?\
Це гарна ідея. Нам слід додатково проаналізувати, чи зможемо ми це зробити, і обговорити це на наступній зустрічі.\
"
    correct_transcript = await transcriber.match_transcript_speakers(full_transcript, post_meeting_recording)
    print(correct_transcript)


if __name__ == "__main__":
    asyncio.run(main())
